app/controllers/static_pages_controller.rb

  def home
    if signed_in?
     @micropost = current_user.microposts.build
     @feed_items= current_user.feed.paginate(page:params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE (user_id IN (3,5,6,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,90) OR user_id = 1) ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (3,5,6,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,90) OR user_id = 1)