app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @user=User.find(params[:id])
    @microposts=@user.microposts.paginate(page:params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]

  def update
    @user=User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["password_digest", "$2a$04$DWgzFX/IRBnhK7JHXPYdsO5NNDUaqFhAMHix6oz8hrh1u2VWNPDmO"], ["updated_at", Wed, 23 Jul 2014 07:12:41 UTC +00:00]]